
Template.postItem.helpers({
 domain: function() {
   var a = document.createElement('a');
   a.href = this.url;
   return a.host;
 }
 
});

/*hash - Имя "якоря" в интернет-адресе документа, если оно есть. (прим. код location.hash = 'someAnchor' не даст результата, перехода не произойдет; хотя хэш-таки изменится)
host - Имя компьютера в сети Интернет вместе с номером порта, если он указан.
hostname - Имя компьютера в сети Интернет.
href - Полный интернет-адрес документа.
pathname - Путь и имя файла, если они есть.
port - Номер порта. Если не указан, возвращает номер 80 - стандартный порт, через который работает протокол HTTP.
protocol - Идентификатор протокола. Если не указан, возвращается "http:".
search - Строка параметров, если она есть.*/